app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "Title 3"], ["body", "Body3but I need 10 chars."], ["created_at", "2022-06-05 22:28:29.942923"], ["updated_at", "2022-06-05 22:28:29.942923"], ["status", "public"]]
---
  def create
    @article = Article.create(
      title: params[:title],
      body: params[:body],
      status: params[:status],
      views: 0,
      floater: 0.1,
      deci: 0.1,
      publish: DateTime.now,
      publishD: Date.today,
      publishT: Time.now,
      bool: true,
      image: 0
    )

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "views" = ?, "floater" = ?, "deci" = ?, "publish" = ?, "publishD" = ?, "publishT" = ?, "bool" = ?, "image" = ? WHERE "articles"."id" = ?
---
  def update #re-finds the article and updates it.
    @article = Article.find(params[:id])
    @article.update(
      title: params[:title],
      body: params[:body],
      status: params[:status],
      views: params[:views],
      floater: params[:floater],
      deci: params[:deci],
      publish: DateTime.now,
      publishD: Date.today,
      publishT: Time.now,
      bool: params[:bool],
      image: Base64.encode64(params[:image])
    )

SELECT "articles".* FROM "articles"
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 22]]
---
  def destroy
    @articles = Article.all
    @article = Article.find(params[:id])
    @article.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "views" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-07-14 21:03:43.304512"], ["views", 120], ["id", 21]]
---
  def addViews
    @article = Article.find(params[:id])
    @article.update(
      views: params[:views].to_i + 100
    )

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def readViews
    @article = Article.find(params[:id])