app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 16]]
---
  def destroy
    @articles = Article.all
    @article = Article.find(params[:id])
    @article.destroy