app/controllers/comments_controller.rb

  def index
    @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def show
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 6], ["id", 14], ["LIMIT", 1]]

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(
          commenter: params[:commenter],
          body: params[:body],
          status: params[:status]
          )
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)